import 'package:cloud_firestore/cloud_firestore.dart';
import 'package:flutter_application_1/Models/Screens/Guids/guid.dart';

class Plant2 {
  final int plantId;
  final String Catagoris;
  final String name;
  final String imageURL;
  final String temperature;
  bool isFavorated2;
  final String Decription;
  bool isSelected2;

  Plant2(
      {required this.plantId,
      required this.Catagoris,
      required this.name,
      required this.imageURL,
      required this.temperature,
      required this.Decription,
      required this.isFavorated2,
      required this.isSelected2});

  Map<String, dynamic> toJson() {
    return {
      'PlantID': plantId,
      'Name': name,
      'Catagoris': Catagoris,
      'ImageURL': imageURL,
      'Temperature': temperature,
      'Decription': Decription,
      'IsFavorated': isFavorated2,
      'IsSelected': isSelected2,
    };
  }

  static Plant2 empty() => Plant2(
        Catagoris: '',
        Decription: '',
        imageURL: '',
        isFavorated2: false,
        isSelected2: false,
        name: '',
        plantId: 0,
        temperature: '',
      );

  factory Plant2.fromSnapshot(DocumentSnapshot<Map<String, dynamic>> document) {
    try {
      if (document.data() != null) {
        final data = document.data()!;

        return Plant2(
          Catagoris: data['Catagoris'] ?? '',
          Decription: data['Decription'] ?? '',
          imageURL: data['ImageURL'] ?? '',
          isFavorated2: data['IsFavorated'] ?? false,
          temperature: data['Temperature'] ?? '',
          name: data['Name'] ?? '',
          plantId: data['PlantID'] ?? 0,
          isSelected2: data['IsSelected'] ?? false,
        );
      } else {
        return Plant2.empty();
      }
    } catch (e) {
      print(e.toString());
      print("Model Error");
      return Plant2.empty();
    }
  }

  static List<Plant2> plantList2 = [
    Plant2(
      plantId: 6,
      Catagoris: 'زستان',
      name: 'سێو',
      imageURL:
          'https://static.vecteezy.com/system/resources/previews/019/818/535/original/group-of-red-apple-fruits-png.png',
      temperature: '١٥-٢٤',
      Decription:
          'بە گشتی  بەرهەمێکی هەمەلایەنەیە کە دەتوانرێت لە کەشوهەوای جۆراوجۆر و بارودۆخی خاکدا بچێنرێت، بەڵام لە ناوچە مامناوەندەکاندا باشترین ئەنجام دەدات کە پلەی گەرمی فێنک و شێی گونجاوە.  بەزۆری گەنم لە وەرزی پایز یان سەرەتای زستاندا دەچێنرێت، ئەمەش بەپێی شوێن و جۆری. وەرزی تایبەت و پێداویستی پلەی گەرمی بۆ گەشەکردنی گەنم بەندە بە جۆراوجۆری گەنم و ئەو ناوچەیەی کە تێیدا دەچێنرێت. گەنم بەرهەمێکی وەرزی فێنک و بە شێوەیەکی گشتی لە کەشوهەوای مامناوەنددا باشترین گەشە دەکات.',
      isFavorated2: false,
      isSelected2: true,
    ),
    Plant2(
      plantId: 7,
      Catagoris: 'زستان',
      name: 'پرتەقاڵ',
      imageURL:
          'https://static.vecteezy.com/system/resources/previews/022/825/544/original/orange-fruit-orange-on-transparent-background-free-png.png',
      temperature: '٧-٢٤',
      Decription:
          'بە دابینکردنی بارودۆخی ژینگەیی گونجاو، بەرهەمهێنەران دەتوانن ڕووەکی زیرەی تەندروست بچێنن و تۆوی تامدار دروێنە بکەن بۆ بەکارهێنانی چێشتلێنان. هەروەها ئامادەیە بۆ ئاوگرتن، بۆیە ئاوەڕۆی دروست زۆر گرنگە بۆ ڕێگریکردن لە ڕوتانەوەی ڕەگ و نەخۆشییە گواستراوەکانی تری خاک. بارودۆخی گەشەکردن: زیرە هەستیارە بە بەستەڵەک، بۆیە گرنگە دوای دوایین بەرواری بەستەڵەک لە بەهاردا لە ناوچە مامناوەندەکاندا بچێنرێت. توانای بەرگەگرتنی پلەی گەرمی فێنکتر و گونجاندنی لەگەڵ وەرزە جیاوازەکانی چاندن وای لێدەکات ببێتە بەرهەمێکی بەنرخ بۆ جووتیارانی ناوچە کشتوکاڵییە جۆراوجۆرەکان. بە گشتی جۆ بەرهەمێکی هەمەلایەنەیە کە دەتوانرێت لە کەشوهەوا و بارودۆخی خاکی جیاوازدا بچێنرێت، بەڵام لە ژینگەی وەرزی فێنکدا باشترین ئەنجام دەدات کە شێی گونجاو و ئاوەڕۆی باشی خاکە. جۆ زیاتر بەرگەی سەرما دەگرێت لە گەنم و لە قۆناغە سەرەتاییەکانی گەشەکردنیدا بەرگەی بەستەڵەک دەگرێت، ئەمەش وایکردووە گونجاو بێت بۆ چاندن لە کەشوهەوای فێنکتردا. لە پاییزدا دەچێنرێت، بەزۆری لە نێوان مانگی ئەیلول و تشرینی دووەمدا، لە کۆتایی بەهار یان سەرەتای هاوینی ساڵی دواتردا دروێنە دەکرێت. جۆ، دانەوێڵەیەکی دانەوێڵە وەک گەنم و وەرزێڕ، بە شێوەیەکی گشتی لە بارودۆخی وەرزی فێنکدا گەشە دەکات.',
      isFavorated2: false,
      isSelected2: true,
    ),
    Plant2(
      plantId: 8,
      Catagoris: 'زستان',
      name: 'لیمۆ',
      imageURL:
          "https://png.pngtree.com/png-clipart/20220802/ourmid/pngtree-lemon-png-images-with-transparent-background-png-image_6095484.png",
      temperature: '٢٠-٣٠',
      Decription:
          'بە دابینکردنی بارودۆخی ژینگەیی گونجاو، بەرهەمهێنەران دەتوانن ڕووەکی زیرەی تەندروست بچێنن و تۆوی تامدار دروێنە بکەن بۆ بەکارهێنانی چێشتلێنان. بە گشتی زیرە بەرهەمێکی وەرزی گەرمە و لە بارودۆخی خۆرگیر و خاکی ئاوڕێژکراودا گەشە دەکات. بە دابینکردنی بارودۆخی ژینگەیی گونجاو، بەرهەمهێنەران دەتوانن ڕووەکی زیرەی تەندروست بچێنن و تۆوی تامدار دروێنە بکەن بۆ بەکارهێنانی چێشتلێنان. بە گشتی زیرە بەرهەمێکی وەرزی گەرمە و لە بارودۆخی خۆرگیر و خاکی ئاوڕێژکراودا گەشە دەکات. زیرە ڕووەکێکی ساڵانەی ڕووەکییە و بۆ تۆوەکەی دەچێنرێت، کە وەک بەهاراتێک لە چێشت لێناندا بەکاردەهێنرێت.',
      isFavorated2: false,
      isSelected2: true,
    ),
    Plant2(
      plantId: 9,
      Catagoris: 'بەهار',
      name: 'شلیک',
      imageURL: "https://upload.wikimedia.org/wikipedia/commons/9/96/Strawberry-icon-1000px.png",
      temperature: '٢٠-٤٠',
      Decription:
          'بەگشتی، برنج بەرهەمێکی گشتگیرە کە دەتوانرێت لە بارودۆخی کشتوکاڵی ئیکۆلۆژی جۆراوجۆردا بچێنرێت، لە کێڵگە لافاواویەکانەوە تا کێڵگە بەرزەکانی باراناوی. لە ناوچە مامناوەندەکاندا، برنج بە شێوەیەکی گشتی لە بەهاردا دەچێنرێت و لە پاییزدا دروێنە دەکرێت. لە ناوچە گەرم و ژێر گەرمەکاندا زۆرجار برنج لە وەرزی تەڕدا دەچێنرێت، کە بارانبارین زۆرە و پلەکانی گەرما گەرمن. برنج بە پلەی یەکەم لە کێڵگە لافاواوییەکاندا دەچێنرێت کە پێیان دەوترێت پادی، هەرچەندە دەتوانرێت لە ناوچە بەرزەکان یان سیستەمی باراناویشدا بچێنرێت. برنج بەرهەمێکی سەرەکی خۆراکییە و یەکێکە لە گرنگترین دانەوێڵەکانی دانەوێڵە لە سەرانسەری جیهاندابە دابینکردنی تێکەڵەیەکی دروستی پلەی گەرمی، ئاو، خاک و شێوازەکانی بەڕێوەبردن، جووتیاران دەتوانن بەرهەمی تەندروست برنجی بچێنن و بەرهەمی بەرز بەدەستبهێنن. .',
      isFavorated2: false,
      isSelected2: true,
    ),
    Plant2(
      plantId: 10,
      Catagoris: 'زستان',
      name: 'هەنار',
      imageURL:
          "https://png.pngtree.com/png-clipart/20240206/original/pngtree-pomegranate-on-a-white-background-sweet-photo-png-image_14245012.png",
      temperature: '٢٥-٣٥',
      Decription:
          'بە گشتی بەرهەمێکی گشتگیرە کە دەتوانرێت لە کەشوهەوا و بارودۆخی خاکی جۆراوجۆردا گەشە بکات، بەڵام لە پلەی گەرمی گەرمدا گەشە دەکات و پێویستی بە شێ و تیشکی خۆری گونجاوە بۆ گەشەکردن و گەشەکردنی گونجاو. باشترین ئەنجام دەدات لەو شوێنانەی کە ڕۆژانە لانیکەم ٦ بۆ ٨ کاتژمێر تیشکی ڕاستەوخۆی خۆریان تێدایە. تیشکی خۆر: گەنمەشامی بەرهەمێکی خۆشەویستی خۆرە و پێویستی بە خۆری تەواو هەیە بۆ گەشەکردن و گەشەکردنی گونجاو. گەنمەشامی بەرهەمێکی دانەوێڵەی وەرزی گەرمە و بە شێوەیەکی بەرفراوان بۆ دانەوێڵە خواردنەکانی دەچێنرێت.',
      isFavorated2: false,
      isSelected2: true,
    ),
  ];

  static List<Plant> plantList = [
    Plant(
      plantId: 6,
      Catagoris: 'زستان',
      name: 'سێو',
      imageURL:
          'https://static.vecteezy.com/system/resources/previews/019/818/535/original/group-of-red-apple-fruits-png.png',
      temperature: '١٥-٢٤',
      Decription:
          'بە گشتی  بەرهەمێکی هەمەلایەنەیە کە دەتوانرێت لە کەشوهەوای جۆراوجۆر و بارودۆخی خاکدا بچێنرێت، بەڵام لە ناوچە مامناوەندەکاندا باشترین ئەنجام دەدات کە پلەی گەرمی فێنک و شێی گونجاوە.  بەزۆری گەنم لە وەرزی پایز یان سەرەتای زستاندا دەچێنرێت، ئەمەش بەپێی شوێن و جۆری. وەرزی تایبەت و پێداویستی پلەی گەرمی بۆ گەشەکردنی گەنم بەندە بە جۆراوجۆری گەنم و ئەو ناوچەیەی کە تێیدا دەچێنرێت. گەنم بەرهەمێکی وەرزی فێنک و بە شێوەیەکی گشتی لە کەشوهەوای مامناوەنددا باشترین گەشە دەکات.',
      isFavorated: false,
      isSelected: true,
    ),
    Plant(
      plantId: 7,
      Catagoris: 'زستان',
      name: 'پرتەقاڵ',
      imageURL:
          'https://static.vecteezy.com/system/resources/previews/022/825/544/original/orange-fruit-orange-on-transparent-background-free-png.png',
      temperature: '٧-٢٤',
      Decription:
          'بە دابینکردنی بارودۆخی ژینگەیی گونجاو، بەرهەمهێنەران دەتوانن ڕووەکی زیرەی تەندروست بچێنن و تۆوی تامدار دروێنە بکەن بۆ بەکارهێنانی چێشتلێنان. هەروەها ئامادەیە بۆ ئاوگرتن، بۆیە ئاوەڕۆی دروست زۆر گرنگە بۆ ڕێگریکردن لە ڕوتانەوەی ڕەگ و نەخۆشییە گواستراوەکانی تری خاک. بارودۆخی گەشەکردن: زیرە هەستیارە بە بەستەڵەک، بۆیە گرنگە دوای دوایین بەرواری بەستەڵەک لە بەهاردا لە ناوچە مامناوەندەکاندا بچێنرێت. توانای بەرگەگرتنی پلەی گەرمی فێنکتر و گونجاندنی لەگەڵ وەرزە جیاوازەکانی چاندن وای لێدەکات ببێتە بەرهەمێکی بەنرخ بۆ جووتیارانی ناوچە کشتوکاڵییە جۆراوجۆرەکان. بە گشتی جۆ بەرهەمێکی هەمەلایەنەیە کە دەتوانرێت لە کەشوهەوا و بارودۆخی خاکی جیاوازدا بچێنرێت، بەڵام لە ژینگەی وەرزی فێنکدا باشترین ئەنجام دەدات کە شێی گونجاو و ئاوەڕۆی باشی خاکە. جۆ زیاتر بەرگەی سەرما دەگرێت لە گەنم و لە قۆناغە سەرەتاییەکانی گەشەکردنیدا بەرگەی بەستەڵەک دەگرێت، ئەمەش وایکردووە گونجاو بێت بۆ چاندن لە کەشوهەوای فێنکتردا. لە پاییزدا دەچێنرێت، بەزۆری لە نێوان مانگی ئەیلول و تشرینی دووەمدا، لە کۆتایی بەهار یان سەرەتای هاوینی ساڵی دواتردا دروێنە دەکرێت. جۆ، دانەوێڵەیەکی دانەوێڵە وەک گەنم و وەرزێڕ، بە شێوەیەکی گشتی لە بارودۆخی وەرزی فێنکدا گەشە دەکات.',
      isFavorated: false,
      isSelected: true,
    ),
    Plant(
      plantId: 8,
      Catagoris: 'زستان',
      name: 'لیمۆ',
      imageURL:
          "https://png.pngtree.com/png-clipart/20220802/ourmid/pngtree-lemon-png-images-with-transparent-background-png-image_6095484.png",
      temperature: '٢٠-٣٠',
      Decription:
          'بە دابینکردنی بارودۆخی ژینگەیی گونجاو، بەرهەمهێنەران دەتوانن ڕووەکی زیرەی تەندروست بچێنن و تۆوی تامدار دروێنە بکەن بۆ بەکارهێنانی چێشتلێنان. بە گشتی زیرە بەرهەمێکی وەرزی گەرمە و لە بارودۆخی خۆرگیر و خاکی ئاوڕێژکراودا گەشە دەکات. بە دابینکردنی بارودۆخی ژینگەیی گونجاو، بەرهەمهێنەران دەتوانن ڕووەکی زیرەی تەندروست بچێنن و تۆوی تامدار دروێنە بکەن بۆ بەکارهێنانی چێشتلێنان. بە گشتی زیرە بەرهەمێکی وەرزی گەرمە و لە بارودۆخی خۆرگیر و خاکی ئاوڕێژکراودا گەشە دەکات. زیرە ڕووەکێکی ساڵانەی ڕووەکییە و بۆ تۆوەکەی دەچێنرێت، کە وەک بەهاراتێک لە چێشت لێناندا بەکاردەهێنرێت.',
      isFavorated: false,
      isSelected: true,
    ),
    Plant(
      plantId: 9,
      Catagoris: 'بەهار',
      name: 'شلیک',
      imageURL: "https://upload.wikimedia.org/wikipedia/commons/9/96/Strawberry-icon-1000px.png",
      temperature: '٢٠-٤٠',
      Decription:
          'بەگشتی، برنج بەرهەمێکی گشتگیرە کە دەتوانرێت لە بارودۆخی کشتوکاڵی ئیکۆلۆژی جۆراوجۆردا بچێنرێت، لە کێڵگە لافاواویەکانەوە تا کێڵگە بەرزەکانی باراناوی. لە ناوچە مامناوەندەکاندا، برنج بە شێوەیەکی گشتی لە بەهاردا دەچێنرێت و لە پاییزدا دروێنە دەکرێت. لە ناوچە گەرم و ژێر گەرمەکاندا زۆرجار برنج لە وەرزی تەڕدا دەچێنرێت، کە بارانبارین زۆرە و پلەکانی گەرما گەرمن. برنج بە پلەی یەکەم لە کێڵگە لافاواوییەکاندا دەچێنرێت کە پێیان دەوترێت پادی، هەرچەندە دەتوانرێت لە ناوچە بەرزەکان یان سیستەمی باراناویشدا بچێنرێت. برنج بەرهەمێکی سەرەکی خۆراکییە و یەکێکە لە گرنگترین دانەوێڵەکانی دانەوێڵە لە سەرانسەری جیهاندابە دابینکردنی تێکەڵەیەکی دروستی پلەی گەرمی، ئاو، خاک و شێوازەکانی بەڕێوەبردن، جووتیاران دەتوانن بەرهەمی تەندروست برنجی بچێنن و بەرهەمی بەرز بەدەستبهێنن. .',
      isFavorated: false,
      isSelected: true,
    ),
    Plant(
      plantId: 10,
      Catagoris: 'زستان',
      name: 'هەنار',
      imageURL:
          "https://png.pngtree.com/png-clipart/20240206/original/pngtree-pomegranate-on-a-white-background-sweet-photo-png-image_14245012.png",
      temperature: '٢٥-٣٥',
      Decription:
          'بە گشتی بەرهەمێکی گشتگیرە کە دەتوانرێت لە کەشوهەوا و بارودۆخی خاکی جۆراوجۆردا گەشە بکات، بەڵام لە پلەی گەرمی گەرمدا گەشە دەکات و پێویستی بە شێ و تیشکی خۆری گونجاوە بۆ گەشەکردن و گەشەکردنی گونجاو. باشترین ئەنجام دەدات لەو شوێنانەی کە ڕۆژانە لانیکەم ٦ بۆ ٨ کاتژمێر تیشکی ڕاستەوخۆی خۆریان تێدایە. تیشکی خۆر: گەنمەشامی بەرهەمێکی خۆشەویستی خۆرە و پێویستی بە خۆری تەواو هەیە بۆ گەشەکردن و گەشەکردنی گونجاو. گەنمەشامی بەرهەمێکی دانەوێڵەی وەرزی گەرمە و بە شێوەیەکی بەرفراوان بۆ دانەوێڵە خواردنەکانی دەچێنرێت.',
      isFavorated: false,
      isSelected: true,
    ),
  ];

  static List<Plant2> getFavoratedPlants2() {
    List<Plant2> _travelList2 = Plant2.plantList2;
    return _travelList2.where((element) => element.isFavorated2 == true).toList();
  }
}
